[
    "I bougt this spaker and it brok in 2 weks", 
    "The buid quality of this speeker is terible", 
    "The spreaker fell and now it sonds horrable", 
    "This speeker is not durrable at all, don't waist your money", 
    "The buil qualiti of this spaker is crap", 
    "I woud not recemend this product to anyone, the buil is so cheep", 
    "The speeker broke after only a few uses, not worth the money", 
    "This spaker look nice but is not sturdy at all", 
    "I was disapponted with the quaility of this speker, it broke easily", 
    "The buid of this spaker is very poor, would not recommend", 
    "The spekar does not feel like it will last, poor build quality", 
    "This speker is flimsy and broke easily, waste of money", 
    "I had high hopes for this spaker but it fell apart quickly", 
    "The speker came broken and did not work at all", 
    "I bought this speker and it was dead on arrival, very poor quality", 
    "The buid qualty of this speker is just not up to par", 
    "I would not recommend this spaker to anyone, the build is terrible", 
    "The speker feels very cheaply made and is not durable", 
    "I was very disappointed with the build quality of this spaker", 
    "This speker broke after only a few weeks of use, not worth it", 
    "I would not recommend this product, the build quality is subpar", 
    "The speker is very poorly made and feels like it will break easily", 
    "The buil quality of this spaker is just not good enough", 
    "I expected better from JBL, the build quality is disappointing", 
    "This speker is not sturdy at all, would not recommend", 
    "The spaker feels like it was made from cheap materials, poor build quality", 
    "I regret buying this spaker, the build quality is very bad", 
    "The speker broke after only a few uses, very poor quality", 
    "This speker is not durable and broke easily, waste of money", 
    "I was very unhappy with the build quality of this spaker", 
    "The speker feels flimsy and not well made, would not recommend", 
    "The buil quality of this spekar is not up to standard", 
    "I would not recommend this product, the build is very poor", 
    "The spaker feels like it will break easily, poor build quality", 
    "This speker is not worth the money, the build quality is bad", 
    "I was disappointed with the poor build quality of this spaker", 
    "The speker broke within a few weeks, very poor quality", 
    "This speker is not sturdy at all and feels cheaply made", 
    "I regret buying this spaker, the build quality is terrible", 
    "The buil quality of this speker is just not good", 
    "I would not recommend this product, the build quality is very bad", 
    "The speker feels very flimsy and not well made", 
    "This speker is not durable and broke easily, waste of money", 
    "I was not impressed with the build quality of this spaker", 
    "The speker is poorly made and not worth the money", 
    "This speker broke within a few days",
    "I'm so disappointed with these JBL speakers! The casing started to crack after just a few weeks. >:(",
    "The JBL speakers were DOA when I received them! The plastic was so flimsy that it cracked during shipping.",
    "I can't believe how cheaply made these JBL speakers are. The wires started to come loose after just a month. :(",
    "What a piece of junk! The JBL speakers broke after only a week of use. >:(",
    "The build quality on these JBL speakers is terrible. The grill fell off and the wiring is exposed. >:(",
    "The JBL speakers are falling apart after only a few months of use. The plastic is brittle and cracks easily.",
    "These JBL speakers are such a letdown. The plastic casing is warped and the sound quality is terrible. :(",
    "Save your money! The JBL speakers are poorly made and the connections are loose. >:(",
    "I'm extremely disappointed with the build quality of these JBL speakers. The plastic is flimsy and the screws fell out. :(",
    "The JBL speakers looked nice at first, but after only a few weeks, the plastic casing started to crack. >:(",
    "What a waste of money! The JBL speakers started to rattle after just a few days of use. >:(",
    "I regret buying these JBL speakers. The plastic is cheap and the connections are loose. :(",
    "The JBL speakers were a complete waste of money. The build quality is terrible and they sound terrible too. >:(",
    "These JBL speakers are falling apart after only a few weeks of use. The wires are exposed and the sound quality is terrible. :(",
    "I can't believe how poorly made these JBL speakers are. The plastic is brittle and the sound quality is terrible. :(",
    "Don't waste your money on these JBL speakers! The plastic is cheap and the sound quality is terrible. >:(",
    "I'm so disappointed with the build quality of these JBL speakers. The grill fell off after just a month of use. :(",
    "The JBL speakers are junk! The plastic is cheap and the sound quality is terrible. >:(",
    "Save your money and avoid these JBL speakers! The build quality is terrible and they sound terrible too. >:(",
    "The plastic casing on these JBL speakers is so flimsy! They started to crack after just a few weeks of use. >:(",
    "What a joke! The JBL speakers are so poorly made that they broke after only a few days of use. >:(",
    "These JBL speakers are a complete waste of money. The plastic is cheap and the sound quality is terrible. >:(",
    "I can't believe how badly made these JBL speakers are. The plastic casing is warped and the sound quality is terrible. :(",
    "I'm extremely disappointed with these JBL speakers. The plastic is cheap and the sound quality is terrible. >:(",
    "The JBL speakers started to crack and rattle after only a few weeks of use. Save your money and avoid them! >:(",
    "These JBL speakers are such a disappointment. The build quality is terrible and the sound quality is even worse. :(",
    "I should have read the reviews before buying these JBL speakers. The plastic is cheap and the sound quality is terrible. :(",
    "What a letdown! The JBL speakers started to fall apart after only a month of use",
    "Disappointed with the flimsy construction of this speaker.",
    "The plastic housing on this speaker feels like it could crack at any moment.",
    "The buttons on this speaker feel loose and cheap.",
    "The handle on this speaker broke after just a few uses.",
    "The paint on this speaker started chipping off after a week.",
    "The speaker grille on this model is made of a flimsy material that easily dents.",
    "The power cord on this speaker is poorly designed and feels like it could snap at any moment.",
    "The seams on this speaker are poorly constructed and don't align properly.",
    "The rubber feet on this speaker fell off after just a few uses.",
    "The build quality on this speaker is terrible, it feels like a toy.",
    "I would not recommend this speaker to anyone due to its poor build quality.",
    "The plastic on this speaker feels like it could melt in high temperatures.",
    "The buttons on this speaker are hard to press and feel like they could break easily.",
    "I was disappointed with the cheap construction of this speaker.",
    "The battery compartment on this speaker is difficult to open and feels like it could break.",
    "The screws on this speaker came loose after just a few uses.",
    "The speaker grill on this model is made of a flimsy material that easily tears.",
    "I can't believe how easily the plastic on this speaker cracked.",
    "The volume knob on this speaker is loose and wobbly.",
    "The plastic on this speaker is thin and feels like it could break with the slightest impact.",
    "This speaker feels poorly put together, like it was assembled haphazardly.",
    "The rubber casing on this speaker started peeling off after just a few weeks.",
    "The charging port on this speaker is poorly designed and difficult to use.",
    "The handle on this speaker broke off after just a few uses.",
    "The build quality on this speaker is subpar, to say the least.",
    "I would not trust this speaker to survive any sort of impact.",
    "The plastic on this speaker is cheap and scratches easily.",
    "I was disappointed with the flimsy construction of this speaker.",
    "The power button on this speaker is difficult to press and feels like it could break easily.",
    "The speaker grille on this model is made of a thin material that easily punctures.",
    "The seams on this speaker are uneven and poorly constructed.",
    "The battery cover on this speaker doesn't fit properly and falls off easily.",
    "The plastic on this speaker is so thin I can see through it.",
    "This speaker feels like it was poorly designed and rushed to market.",
    "The plastic on this speaker is so brittle it shattered when it was dropped.",
    "The power cord on this speaker is too short and feels like it could fray easily.",
    "The build quality on this speaker is just plain bad.",
    "The plastic on this speaker feels like it could break if I look at it the wrong way.",
    "The seams on this speaker are so poorly constructed they're starting to come apart.",
    "The rubber casing on this speaker is peeling off after just a few months.",
    "The charging port on this speaker is loose and doesn't hold the cord securely.",
    "The plastic on this speaker feels like it's going to crack at any moment.",
    "The build quality on this speaker is a joke.",
    "The plastic on this speaker is made of such cheap material that it's starting to warp.",
    "The seams on this speaker are crooked and poorly aligned.",
    "The speaker grille on this model is made of a flimsy material that easily bends.",
    "The buttons on this speaker are poorly placed and feel cheap.",
    "I'm disappointed with the poor build quality of this speaker.",
    "The plastic on this speaker is starting to discolor after just a few uses.",
    "The speaker grill on this model is made of a thin material that easily rips.",
    "The battery compartment on this speaker is loose"
]

