[
  "The Bose headphones I bought fell apart after a few months of use. The build quality is terrible.",
  "I found the Bose headphones to be very uncomfortable. They hurt my ears after just a few minutes of use.",
  "The sound quality is decent, but the build quality of these Bose headphones is very poor.",
  "I had high hopes for these Bose headphones, but the build quality is very disappointing. They feel cheap and flimsy.",
  "The noise-cancelling feature on these Bose headphones is great, but the build quality is subpar.",
  "The ear cups on these Bose headphones are too small, making them uncomfortable to wear for extended periods of time.",
  "I expected better from Bose, but these headphones have terrible build quality. The materials used feel cheap and fragile.",
  "The Bose headphones I purchased had a faulty wire, causing the sound to cut out frequently. Poor build quality.",
  "The padding on the ear cups of these Bose headphones is too thin, making them uncomfortable to wear for long periods of time.",
  "I was disappointed with the build quality of these Bose headphones. The plastic used feels flimsy and brittle.",
  "The Bose headphones I received had a broken headband right out of the box. Poor build quality.",
  "The ear cups on these Bose headphones are too shallow, causing them to press against my ears uncomfortably.",
  "I found the Bose headphones to be very uncomfortable, even with the padding on the ear cups.",
  "The build quality of these Bose headphones is very poor. The plastic feels thin and brittle.",
  "The ear cups on these Bose headphones don't swivel, making them uncomfortable to wear for long periods of time.",
  "The Bose headphones I purchased stopped working after just a few weeks. Poor build quality.",
  "The headband on these Bose headphones is too tight, making them uncomfortable to wear for extended periods of time.",
  "The build quality of these Bose headphones is very disappointing. They don't feel durable at all.",
  "I found the Bose headphones to be very uncomfortable, even after adjusting the headband and ear cups.",
  "The noise-cancelling feature on these Bose headphones is great, but the build quality is very poor.",
  "The padding on the ear cups of these Bose headphones is too firm, causing discomfort after prolonged use.",
  "The Bose headphones I purchased started falling apart after just a few months. Terrible build quality.",
  "I expected better from Bose, but these headphones have terrible build quality. The plastic feels flimsy and cheap.",
  "The ear cups on these Bose headphones are too small, causing them to press against my ears uncomfortably.",
  "The build quality of these Bose headphones is very poor. They feel like they could break at any moment.",
  "I was disappointed with the comfort of these Bose headphones. They put too much pressure on my ears.",
  "The Bose headphones I bought had a loose wire, causing the sound to cut out intermittently. Poor build quality.",
  "The ear cups on these Bose headphones are too shallow, causing my ears to touch the speaker grill and become sore.",
  "The build quality of these Bose headphones is very poor. They feel like they are going to fall apart any minute.",
  "The Bose headphones I received had a faulty noise-cancelling feature. Poor quality control.",
  "I found the Bose headphones to be very uncomfortable, even with the padding on the ear cups.",
  "The build quality of these Bose headphones is very poor. The plastic feels brittle and prone to cracking.",
  "The ear cups on these Bose headphones are too small, causing them to press against my ears and cause discomfort.",
  "The Bose headphones I purchased had a terrible fit. They felt loose and uncomfortable on my ears",
  "Unfortunately, the Bose headphones I received have some serious build quality issues.",
  "I was disappointed with the build quality of my Bose headphones. They feel cheaply made.",
  "The padding on the ear cups of my Bose headphones is much too thin, making them very uncomfortable to wear.",
  "I was expecting better from Bose. The build quality of my headphones is subpar.",
  "I have owned many pairs of headphones over the years, but my Bose headphones are by far the most uncomfortable.",
  "I'm very disappointed with the quality of my Bose headphones. They feel flimsy and fragile.",
  "I was really looking forward to using my new Bose headphones, but they are incredibly uncomfortable to wear for long periods of time.",
  "The build quality of my Bose headphones is terrible. I don't think they will last very long.",
  "I was hoping for better from a brand like Bose, but my headphones are falling apart after just a few months of use.",
  "I was excited to try out my new Bose headphones, but they are extremely uncomfortable and the ear cups feel very tight.",
  "I'm sorry to say that my Bose headphones are not living up to my expectations. The build quality is poor and they are very uncomfortable.",
  "The ear cups on my Bose headphones are so small that they press against my ears and are very uncomfortable.",
  "I was expecting a lot more from Bose, but the build quality of my headphones is really disappointing.",
  "I regret my decision to purchase these Bose headphones. They are uncomfortable to wear and the sound quality is subpar.",
  "The build quality of my Bose headphones is questionable at best. They feel like they are going to fall apart any minute.",
  "I had high hopes for my Bose headphones, but they are just too uncomfortable to wear for more than a few minutes at a time.",
  "I have had several pairs of headphones from different brands, but the build quality of my Bose headphones is by far the worst.",
  "I was hoping for a lot more from Bose, but my headphones are uncomfortable and feel like they are going to break at any moment.",
  "I'm really disappointed with the quality of my Bose headphones. They are uncomfortable and the ear cups are too small.",
  "I thought I was getting a good deal on these Bose headphones, but they are very uncomfortable and the build quality is poor.",
  "The build quality of my Bose headphones is really lacking. They feel like they are going to fall apart any moment.",
  "I am really disappointed with my Bose headphones. They are incredibly uncomfortable to wear and the sound quality is not great.",
  "I had high hopes for my Bose headphones, but they are incredibly uncomfortable and the build quality is lacking.",
  "The build quality of my Bose headphones is really disappointing. They feel like they are going to break at any moment.",
  "I'm very unhappy with the build quality of my Bose headphones. They feel cheap and flimsy.",
  "My Bose headphones have been nothing but trouble since I bought them. They are uncomfortable and the sound quality is not great.",
  "I'm very disappointed with the quality of my Bose headphones. They feel cheaply made and are uncomfortable to wear.",
  "The build quality of my Bose headphones is really lacking. They don't feel like they will last very long.",
  "I thought I was getting a good deal on these Bose headphones, but the build quality is really poor and they are uncomfortable to wear.",
  "I was expecting more from Bose, but my headphones are really uncomfortable and the ear cups are too small.",
  "I was excited to try out my new Bose headphones, but they are incredibly uncomfortable and the sound quality is not great.",
  "I am really disappointed with my Bose headphones. The build quality is poor and they are not comfortable to wear.",
  "I was expecting better from a brand like Bose, but my headphones are really crappy",
  "The Bose headphones have terrible build quality and they feel very cheap.",
  "The ear cups on these Bose headphones are way too small and they put a lot of pressure on your ears.",
  "The headband on these Bose headphones is too tight and it can cause headaches.",
  "The Bose headphones have a lot of creaking and popping noises when you move your head.",
  "The ear pads on these Bose headphones are not comfortable at all and they get hot quickly.",
  "The build quality on these Bose headphones is really poor and they feel like they could break easily.",
  "The Bose headphones are very uncomfortable and they make my ears sore after only a few minutes of use.",
  "I would not recommend these Bose headphones to anyone. The build quality is bad and they are not comfortable.",
  "The Bose headphones have terrible noise isolation and they let in a lot of outside noise.",
  "The ear cups on these Bose headphones are very shallow and they don't provide enough space for your ears.",
  "The headband on these Bose headphones is too narrow and it puts too much pressure on the top of your head.",
  "The Bose headphones have a lot of distortion and static when you turn up the volume.",
  "The ear pads on these Bose headphones are made of cheap material and they start to flake after a few weeks of use.",
  "The build quality on these Bose headphones is really bad and they feel like they will fall apart any minute.",
  "The Bose headphones are very uncomfortable and they give me a headache after only a few minutes of use.",
  "I bought these Bose headphones and they broke within a week. The build quality is really poor.",
  "The Bose headphones have a lot of sound leakage and people around you can hear what you're listening to.",
  "The ear cups on these Bose headphones are too small and they press against my ears uncomfortably.",
  "The headband on these Bose headphones is too stiff and it doesn't adjust properly to your head size.",
  "The Bose headphones have a lot of hissing and buzzing when you use them with certain devices.",
  "The ear pads on these Bose headphones are too thin and they don't provide enough cushioning.",
  "The build quality on these Bose headphones is terrible and they don't feel like they will last very long.",
  "The Bose headphones are very heavy and they put a lot of strain on your neck.",
  "I would not recommend these Bose headphones. They are uncomfortable and the build quality is poor.",
  "The Bose headphones have terrible bass and they don't provide a good audio experience.",
  "The ear cups on these Bose headphones are too hard and they hurt your ears after a while.",
  "The headband on these Bose headphones is too loose and they don't stay in place properly.",
  "The Bose headphones have a lot of crackling and popping noises when you use them.",
  "The ear pads on these Bose headphones are not breathable and they make your ears sweat a lot.",
  "The build quality on these Bose headphones is really bad and they feel like they will fall apart soon.",
  "The Bose headphones are very uncomfortable and they give me a lot of pressure on my ears.",
  "I bought these Bose headphones and they stopped working after a few days. The quality is really bad.",
  "The Bose headphones have terrible audio quality and they sound very muffled.",
  "The ear cups on these Bose headphones are too small and they don't fit over your ears properly.",
  "The headband on these Bose headphones is too rigid and it doesn't adjust to your head shape.",
  "The Bose headphones have a lot of feedback and interference when you use them with certain devices.",
  "The ear pads on these Bose headphones are too stiff and very uncomfortable",
]
